Revit 2027 API
DockablePaneProviderData.ContextualHelp Property
 The contextual help associated with the pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ContextualHelp ContextualHelp { get; set; }
Public Property ContextualHelp As ContextualHelp
	Get
	Set
public:
property ContextualHelp^ ContextualHelp {
	ContextualHelp^ get ();
	void set (ContextualHelp^ value);
}
member ContextualHelp : ContextualHelp with get, set
Property Value
ContextualHelp
Remarks
 If set, the contents of this Contextual Help will be used to respond to a user request for help (typically this is as a result of pressing F1 while the dockable pane has focus).
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace